[
  {
    "name": "Beef Tenderloin With Creamy Alouette® Mushroom Sauce",
    "serves": 2,
    "description": "You can never have too many side dish recipes, so give Beef Tenderloin With Creamy Alouette® Mushroom Sauce a try. Watching your figure? This gluten free and primal recipe has 371 calories, 11g of protein, and 33g of fat per serving. This recipe serves 2 and costs $1.74 per serving. 40 people have tried and liked this recipe. If you have beef tenderloin steaks, milk, shallot, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 51%. This score is solid. Try Beef Tenderloin with Mushroom Sauce, Beef Tenderloin in Mushroom Sauce, and Beef Tenderloin with Mushroom-Red Wine Sauce for similar recipes.",
    "ingredients": [
      "2 cups sliced baby Portobello mushrooms",
      "2 ounces beef tenderloin steaks, 11/2 inches thick (6 to 8 ounes each)",
      "1/4 cup butter",
      "3 teaspoons extra virgin olive oil, divided",
      "1 teaspoon minced fresh parsley, if desired",
      "1/2 cup milk",
      "1/2 large shallot, thinly slivered",
      "1/4 cup Alouette® Garlic & Herbs, or Alouette® Savory Vegetable"
    ],
    "recipe": "Heat broiler.Coat all sides of tenderloin with 1 tsp. of the olive oil.  Place on broiler pan.  Season to taste with salt and pepper.  Broil 4 inches from heat for 6 minutes or until well-browned. Turn. Broil 6 to 8 minutes or until desired doneness.Meanwhile, heat remaining olive oil and the butter in small skillet over medium heat.Add shallot; cook 1 minute.Add mushrooms.  Cook 2 to 3 minutes or until tender, stirring frequently.Stir in Alouette, adding milk to desired consistency.  Heat just until warm.Spoon sauce over tenderloins.  Sprinkle with parsley.",
    "time_to_cook": 45,
    "url": "http://www.foodista.com/recipe/6JNVQ85J/beef-tenderloin-with-creamy-alouette-mushroom-sauce"
  },
  {
    "name": "Crispy Buttermilk Fried Chicken",
    "serves": 6,
    "description": "Forget going out to eat or ordering takeout every time you crave Southern food. Try making Crispy Buttermilk Fried Chicken at home. One portion of this dish contains roughly 16g of protein, 15g of fat, and a total of 260 calories. For 62 cents per serving, this recipe covers 9% of your daily requirements of vitamins and minerals. This recipe serves 6. 53 people found this recipe to be delicious and satisfying. This recipe from Foodista requires vegetable oil, buttermilk, salt, and paprika. It works best as a main course, and is done in roughly around 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 38%, which is rather bad. Users who liked this recipe also liked Crispy Buttermilk Fried Chicken, Crispy Buttermilk Fried Chicken, and Crispy Oven Fried Buttermilk Chicken.",
    "ingredients": [
      "2 pounds chicken",
      "3/4 cup flour",
      "2 teaspoons salt",
      "1 teaspoon paprika",
      "1 teaspoon pepper",
      "1 cup buttermilk",
      "Vegetable oil (enough to cover chicken), about 1 quart"
    ],
    "recipe": "Mix flour, salt, paprika and pepper. Dip chicken in buttermilk and then into flour mixture. Cook chicken in oil, starting on medium-high heat, then, when chicken is browned, reduce heat to medium and cook an additional 30 to 35 minutes until chicken is done (approx 150-155 degrees F internal), turning occasionally.",
    "time_to_cook": 45,
    "url": "https://www.foodista.com/recipe/G2QDD6GF/crispy-buttermilk-fried-chicken"
  },
  {
    "name": "Sterling Cooper Blini with Caviar",
    "serves": 16,
    "description": "Sterling Cooper Blini with Caviar might be just the morn meal you are searching for. For 25 cents per serving, this recipe covers 2% of your daily requirements of vitamins and minerals. Watching your figure? This pescatarian recipe has 84 calories, 1g of protein, and 7g of fat per serving. A few people made this recipe, and 22 would say it hit the spot. This recipe is typical of Eastern European cuisine. A mixture of cream, sugar, caviar, and a handful of other ingredients are all it takes to make this recipe so yummy. From preparation to the plate, this recipe takes around 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 11%. This score is not so amazing. Similar recipes include Sterling Cooper Sling Cocktail, Vichyssoise of Kumumoto Oysters and Royal Sterling Caviar, and Potato Blini with Caviar.",
    "ingredients": [
      "1/2 teaspoon baking powder",
      "1/2 cup butter",
      "Caviar, for topping",
      "1 egg",
      "1/2 cup sifted all-purpose flour",
      "¾ cup milk",
      "3 tablespoons sour cream, plus additional for topping blini",
      "1/2 teaspoon sugar"
    ],
    "recipe": "In a large bowl, sift the flour and baking powder together. Add the milk, sugar and 2 tablespoons sour cream. Beat the egg until frothy, add to batter and stir well. Let batter stand for 20 minutes.Melt butter on a griddle or large skillet.  Fry small (2-3 inch) pancakes in very hot butter. Drain on paper towels. Top each blini with sour cream and caviar before serving.",
    "time_to_cook": 45,
    "url": "http://www.foodista.com/recipe/FR7746PB/sterling-cooper-blini-with-caviar"
  },
  {
    "name": "Paneer Makhani",
    "serves": 4,
    "description": "Need a gluten free and lacto ovo vegetarian side dish? Paneer Makhani could be an outstanding recipe to try. One serving contains 295 calories, 9g of protein, and 26g of fat. For $2.05 per serving, this recipe covers 4% of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe from Foodista has 10 fans. Head to the store and pick up paneer, salt, cumin powder, and a few other things to make it today. From preparation to the plate, this recipe takes approximately approximately 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 12%, which is not so awesome. Try paneer makhani , how to make paneer makhani | paneer s, Paneer Makhani (Paneer Butter Masala) (Restaurant Style), and Paneer Makhani for similar recipes.",
    "ingredients": [
      "1 cup cubed paneer ( Indian Cottage cheese)",
      "1 medium onion, skinless",
      "1 clove garlic",
      "1 teaspoon grated ginger",
      "1/2 teaspoon turmeric powder",
      "1 teaspoon coriander powder",
      "1 teaspoon cumin powder",
      "2 teaspoons Tomato Paste, mixed thoroughly in a cup of water",
      "2 teaspoons kasuri methi ( dried fenugreek leaves)",
      "1/2 cup heavy whipping cream",
      "salt to taste",
      "1/2 teaspoon sugar",
      "1 teaspoon canola oil",
      "2 teaspoons Kashmiri mirch ( Kashmiri Red Chilli Powder)"
    ],
    "recipe": "Heat the oil in a pan. Grate the onion and the garlic into it. Add the grated ginger as well. Let it saut for 2 mins. Add in the turmeric powder, coriander powder, cumin powder and kashmiri mirch and saut for a couple more minutes. Add the kasuri methi and the tomato paste mixed in water. Add some more water if required. When it starts to boil, add the salt and paneer cubes. Let it cook in the gravy for a couple of minutes. Add the cream and sugar and mix well. Dont let it boil after you have added the cream, just simmer for 15 minutes or so.",
    "time_to_cook": 45,
    "url": "https://www.foodista.com/recipe/ZVKR6J5M/paneer-makhani"
  },
  {
    "name": "Rum Raisin Carrot Cake with Cream Cheese Frosting",
    "serves": 8,
    "description": "One serving contains 1147 calories, 13g of protein, and 63g of fat. This recipe serves 8 and costs $2.8 per serving. 60 people were impressed by this recipe. It will be a hit at your Easter event. From preparation to the plate, this recipe takes roughly 45 minutes. A mixture of baking powder, vanillan extract, pecans, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a vegetarian diet. All things considered, we decided this recipe deserves a spoonacular score of 59%. This score is good. Try Carrot Cake With Cream Cheese Frosting, Carrot Cake with Cream Cheese Frosting, and Raw Carrot Cake With Cream Cheese Frosting for similar recipes.",
    "ingredients": [
      "2 teaspoons baking powder",
      "2 teaspoons baking soda",
      "1/2 cup buttermilk",
      "1 pound carrots, peeled and coarsely shredded",
      "1 teaspoon cinnamon",
      "2 cups confectioners' sugar",
      "2 8-ounces packages cream cheese, softened",
      "1/2 cup dark rum",
      "4 large eggs",
      "2 cups all-purpose flour",
      "Zest of 1 orange",
      "1/2 cup chopped pecans (optional)",
      "1 cup 1 pecans (4 ounces)",
      "1 cup raisins",
      "1 teaspoon salt",
      "2 cups sugar",
      "2 sticks unsalted butter, softened",
      "1 tablespoon pure vanilla extract",
      "1 1/2 teaspoons pure vanilla extract",
      "1 cup vegetable oil"
    ],
    "recipe": "Soak raisins in rum, preferably overnight, until raisins are nice and plump.Preheat the oven to 325. Butter two 9-inch cake pans; line the bottoms with parchment. Butter the paper and flour the pans.For the cake:Spread the pecans on a baking sheet and toast for 8 minutes, until fragrant. Cool and finely chop.In a bowl, whisk the flour, baking powder, baking soda, cinnamon and salt.In a small bowl, whisk the oil, buttermilk and vanilla.In a large bowl, using an electric mixer, beat the eggs and sugar at high speed until pale, 5 minutes.Beat in the liquid ingredients, then beat in the dry ingredients just until moistened.Stir in the carrots, pecans and raisins.Divide the batter between the pans and bake the cakes for 55 minutes to 1 hour, until springy and golden.Let the cakes cool on a rack for 30 minutes, then unmold the cakes and let cool completely.For the Frosting:In a large bowl, using an electric mixer, beat the butter and cream cheese at high speed until light, about 5 minutes.Beat in the vanilla and orange zest, then the confectioners' sugar; beat at low speed until incorporated. Increase the speed to high and beat until light and fluffy, about 3 minutes.Peel off the parchment paper and invert one cake layer onto a plate. Spread with a slightly rounded cup of the frosting. Top with the second cake layer, right side up. Spread the top and sides with the remaining frosting and refrigerate the cake until chilled, about 1 hour.",
    "time_to_cook": 45,
    "url": "http://www.foodista.com/recipe/FDQ45DLN/rum-raisin-carrot-cake-with-cream-cheese-frosting"
  },
  {
    "name": "Asparagus and Pea Soup: Real Convenience Food",
    "serves": 2,
    "description": "You can never have too many soup recipes, so give Asparagus and Pea Soup: Real Convenience Food a try. For $3.24 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. One serving contains 240 calories, 11g of protein, and 8g of fat. This recipe from fullbellysisters.blogspot.com has 204 fans. From preparation to the plate, this recipe takes about 20 minutes. It will be a hit at your Autumn event. If you have onion, peas, a couple of garlic cloves, and a few other ingredients on hand, you can make it. It is a good option if you're following a caveman, gluten free, primal, and vegan diet. All things considered, we decided this recipe deserves a spoonacular score of 96%. This score is spectacular. Try Butternut Squash & Pear Soup: Real Convenience Food, Tomato, Cucumber & Onion Salad with Feta Cheese: Real Convenience Food, and Everyday Granola from Real Food, Real Simple for similar recipes.",
    "ingredients": [
      "1 bag of frozen organic asparagus (preferably thawed)",
      "1T EVOO (extra virgin olive oil)",
      "a couple of garlic cloves",
      "1/2 onion",
      "2-3c of frozen organic peas",
      "1 box low-sodium vegetable broth"
    ],
    "recipe": "Chop the garlic and onions.Saute the onions in the EVOO, adding the garlic after a couple of minutes; cook until the onions are translucent. Add the whole bag of asparagus and cover everything with the broth. Season with salt and pepper and a pinch of red pepper flakes, if using.Simmer until the asparagus is bright green and tender (if you've thawed the asparagus it will only take a couple of minutes). Turn off the heat and puree using an immersion blender.Add peas (the heat of the soup will quickly thaw them) and puree until smooth; add more until it reaches the thickness you like.Top with chives and a small dollop of creme fraiche or sour cream or greek yogurt.",
    "time_to_cook": 20,
    "url": "http://fullbellysisters.blogspot.com/2011/03/asparagus-and-pea-soup-real-convenience.html"
  },
  {
    "name": "Pork Chops with Garlic Cream",
    "serves": 4,
    "description": "You can never have too many main course recipes, so give Pork Chops with Garlic Cream a try. This recipe makes 4 servings with 712 calories, 51g of protein, and 51g of fat each. For $3.5 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. A couple people made this recipe, and 13 would say it hit the spot. A mixture of pork chops, shallot, heavy cream, and a handful of other ingredients are all it takes to make this recipe so yummy. To use up the salt you could follow this main course with the Apple Turnovers Recipe as a dessert. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 80%. This score is solid. Try Pork Chops with Wine and Garlic, Honey-Garlic Pork Chops, and Honey-Garlic Pork Chops for similar recipes.",
    "ingredients": [
      "2 tablespoon butter",
      "1/3 cup buttermilk",
      "1/3 cup dry white wine",
      "3 sprigs Fresh thyme",
      "1 cup heavy cream",
      "pepper",
      "900 grams pork chops",
      "salt",
      "1 medium shallot, minced",
      "2 tablespoon vegetable oil",
      "12 large garlic cloves, all about the same size, and peeled but left whole"
    ],
    "recipe": "In a small sauce pan melt the butter over medium-low heat and cook the shallots until softened, about 5 minutes.Add the wine, thyme and a generous  teaspoon salt. Raise the heat to medium and simmer until the liquid is reduced to 2 tablespoons. Stir in the heavy cream and the buttermilk and all the garlic cloves.Return to a bare simmer and cook, stirring occasionally, until the garlic is completely tender, 40 to 45 minutes.Transfer the garlic mixture to a blender and puree until very smooth, about 1 minute. Return the garlic sauce to the saucepan. It should be thick enough to cover the back of a wooden spoon but easy to pour. Set aside covered to keep warm.Preheat oven to 375.Salt and pepper generously the pork chops. In a large skillet over medium high heat add the oil. When hot add the chops and sear them on each side. 2minutes each sides.Remove from the stove and place in the hot oven. Cook for 3 minutes at 375 then lower the heat to 300 for another 5 minutes. The chops need to be springy to the touch and golden brown on the outside.",
    "time_to_cook": 45,
    "url": "http://www.foodista.com/recipe/MMSZLRHM/pork-chops-with-garlic-cream"
  },
  {
    "name": "Rice and Peas with Coconut Curry Mackerel",
    "serves": 4,
    "description": "Rice and Peas with Coconut Curry Mackerel might be just the Indian recipe you are searching for. One serving contains 624 calories, 31g of protein, and 34g of fat. This gluten free, dairy free, and pescatarian recipe serves 4 and costs $2.42 per serving. This recipe from Afrolems has 26 fans. It works well as a budget friendly main course. From preparation to the plate, this recipe takes roughly 45 minutes. If you have seasoning cubes, mackerel, curry powder, and a few other ingredients on hand, you can make it. To use up the curry powder you could follow this main course with the Curry Ice Cream with Mango and Pistachio as a dessert. All things considered, we decided this recipe deserves a spoonacular score of 95%. This score is amazing. Similar recipes include Coconut Chicken Curry with Snow Peas and Rice, Black Eyed Peas Curry (With Coconut) (Lobia Curry), and Skillet Chicken with Snap Peas, Mushrooms, and Coconut Curry.",
    "ingredients": [
      "2 cups of coconut milk",
      "1 tablespoon of corn starch",
      "2 tablespoons of curry powder",
      "1 clove of garlic (chopped)",
      "Seasoning cubes",
      "1 medium piece of Mackerel (chopped in 4 pieces)",
      "1/2 bulb of onion",
      "1/2 cup of red kidney beans",
      "1 cup of Rice",
      "3 scotch bonnet peppers"
    ],
    "recipe": "Pour 1 cup of coconut milk in a pot with 1 seasoning cube and allow to boil for a minute.Pour in your rice and peas in the boiling coconut milk and pour 2 cups of water and leave to boil till the rice and peas are soft on low heat.In a separate pot, season and bring the mackerel to boil in the rest of the coconut milk, curry powder and some water.Toss in the chopped onion, scotch bonnet peppers and garlic and allow to simmer on medium heat.Once the fish is cooked, add the corn starch to thicken the sauce and allow to simmer for 4 minutes on low heat.Serve with the rice and peas",
    "time_to_cook": 45,
    "url": "http://www.afrolems.com/2014/10/31/rice-and-peas-with-coconut-curry-mackerel/"
  },
  {
    "name": "Banana Foster Bread Pudding",
    "serves": 8,
    "description": "Banana Foster Bread Pudding requires roughly roughly 45 minutes from start to finish. This recipe serves 8 and costs $1.75 per serving. Watching your figure? This lacto ovo vegetarian recipe has 1040 calories, 12g of protein, and 45g of fat per serving. A couple people made this recipe, and 27 would say it hit the spot. This recipe from Foodista requires bananas, bananas, milk, and heavy cream. It works well as a dessert. Overall, this recipe earns a solid spoonacular score of 44%. Users who liked this recipe also liked Bananas Foster Banana Pudding, Bananas Foster Bread Pudding, and Bananas Foster Bread Pudding.",
    "ingredients": [
      "1/2 C. - Butter (room temp)",
      "1 1/2 C. - Brown Sugar",
      "3 - Eggs",
      "1 lb. - Bread (I used a brioche roll)",
      "2 C. - Heavy Cream",
      "1 1/2 C. - Milk",
      "1 C. - Cream De Banana Liqueur",
      "2 Tsp. - Ground Cinnamon",
      "1 Tsp. - Vanilla",
      "6 - Bananas (sliced)",
      "2 - Bananas (sliced)",
      "1/4 C. - Butter",
      "1 C. - Brown Sugar"
    ],
    "recipe": "Preheat oven to 325 degrees.  In a large bowl, cream together the butter and sugar.  Beat in eggs then stir in the cream, milk, liqueur, cinnamon, vanilla and bread.  Once well combined fold in the sliced bananas carefully.  Pour into a 13x9 baking dish and cook for 90 minutes or until completely set.  This can be served hot, room temp or cold. It can be topped with vanilla ice cream, whipped cream or as I did with the following topping.In a sauce pan over medium high heat melt the butter then add the brown sugar.  Once melted add the banana slices and stir gently, cook until the syrup has reduced and the bananas have caramelized.  This will take about 5-10 minutes, be careful to not let your sugar burn. When ready ladle some of this hot sauce over each serving of bread pudding.",
    "time_to_cook": 45,
    "url": "https://www.foodista.com/recipe/4RYKKRMV/banana-foster-bread-pudding"
  },
  {
    "name": "Brown Rice Mushroom Pilaf",
    "serves": 4,
    "description": "Brown Rice Mushroom Pilaf is a side dish that serves 4. One serving contains 224 calories, 5g of protein, and 5g of fat. For 42 cents per serving, this recipe covers 11% of your daily requirements of vitamins and minerals. 15 people have tried and liked this recipe. It is brought to you by Foodista. Head to the store and pick up unrefined sunflower oil, ground pepper, water, and a few other things to make it today. From preparation to the plate, this recipe takes approximately approximately 45 minutes. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. Overall, this recipe earns a tremendous spoonacular score of 93%. Brown Rice-Mushroom Pilaf, Quick Brown Rice and Mushroom Pilaf, and Brown Rice Pilaf are very similar to this recipe.",
    "ingredients": [
      "1 large onion, chopped",
      "1 cup brown rice",
      "1 cup sliced fresh mushrooms (I used small-size champignons; don't use canned mushrooms because they're absolutely tasteless.)",
      "1 tbsp unrefined sunflower oil",
      "2 cups water",
      "sea salt, to taste",
      "1/3 tsp ground pepper"
    ],
    "recipe": "Heat oil in a large saucepan over medium heat. Saut chopped onion and sliced mushrooms for 5 minutes.Add brown rice and stir to coat in oil.Add water.Bring to a boil, then simmer for 30 minutes. Remove from heat and cover with a lid. Let it rest until all liquid is absorbed.",
    "time_to_cook": 45,
    "url": "https://www.foodista.com/recipe/S4DB57DW/brown-rice-mushroom-pilaf"
  },
  {
    "name": "Jalapeno Cheese Quick Bread",
    "serves": 12,
    "description": "The recipe Jalapeno Cheese Quick Bread can be made in around around 45 minutes. This breakfast has 114 calories, 5g of protein, and 5g of fat per serving. This recipe serves 12 and costs 22 cents per serving. 36 people were impressed by this recipe. This recipe from Foodista requires pickled jalapenos, egg, olive oil, and cheddar cheese. It is a good option if you're following a lacto ovo vegetarian diet. Overall, this recipe earns a solid spoonacular score of 47%. If you like this recipe, you might also like recipes such as Jalapeño-Corn-Beer Quick Bread, Jalapeño Summer Squash Quick Bread for #BreadBakers, and Jalapeno Cheese Bread for Bread Machine.",
    "ingredients": [
      "3/4 cup unbleached all purpose flour",
      "3/4 cup whole-wheat flour",
      "1 tbsp baking powder",
      "1/2 tsp. salt",
      "1 tbsp light olive oil",
      "1 egg, lightly beaten",
      "3/4 cup non-fat milk",
      "1 cup light cheddar cheese (I used a light Mexican blend)",
      "1/4 cups pickled jalapenos, drained, diced"
    ],
    "recipe": "Heat oven to 350Lightly grease loaf pan, 9x5x3 or two mini muffin pans with cooking spray.Stir together flour, cheese, baking powder, and salt in medium bowl. Add olive oil, egg and milk, stir till combined. Fold in jalapenos.Pour into panBake 30 to 45 minutes or until golden brown and toothpick inserted in center comes out clean. Cool 5 minutes; run knife around edges of pan to loosen. Remove from pan to wire rack. Cool 30 minutes before slicing, if you can wait that long, I didnt.",
    "time_to_cook": 45,
    "url": "https://www.foodista.com/recipe/Q5S66TH2/jalapeno-cheese-quick-bread"
  },
  {
    "name": "Brown Butter Twice Baked Sweet Potatoes",
    "serves": 4,
    "description": "Brown Butter Twice Baked Sweet Potatoes might be just the main course you are searching for. One serving contains 689 calories, 16g of protein, and 55g of fat. For $3.43 per serving, this recipe covers 27% of your daily requirements of vitamins and minerals. This recipe from Pink When has 8242 fans. From preparation to the plate, this recipe takes roughly 1 hour and 35 minutes. Head to the store and pick up sweet potatoes, butter, buttermilk, and a few other things to make it today. To use up the buttermilk you could follow this main course with the Buttermilk Pie as a dessert. It is a good option if you're following a gluten free and primal diet. All things considered, we decided this recipe deserves a spoonacular score of 90%. This score is tremendous. Try Twice Baked Sweet Potatoes {with Brown Sugar & Pecans}, Twice Baked Sweet Potatoes with Brown Sugar, Pecans & Marshmallows, and Maple Brown Butter Mashed Sweet Potatoes for similar recipes.",
    "ingredients": [
      "2 very ripe avocados, pitted and skins removed",
      "2 tablespoons buttermilk",
      "4 strips of bacon, cooked until crisp and chopped",
      "1/4 cup fresh parsley, chopped",
      "6 ounces goat's cheese, crumbled",
      "salt and black pepper",
      "1/2 cup sour cream (plain Greek yogurt may be substituted)",
      "4 medium sweet potatoes",
      "6 tablespoons unsalted butter"
    ],
    "recipe": "Preheat your oven to 400 degrees F. Poke your sweet potatoes with a fork and place them directly on the rack of your oven. Place a piece of foil on the rack below to reduce mess. Bake the sweet potatoes for 45-50 minutes or until tender. Times may vary depending on how hot your oven gets.Remove the potatoes from the oven and let stand at room temperature until they are cool enough to handle, about 20-30 minutes. Leave the oven on.While your potatoes are cooling, melt the butter over medium heat. Continue to cook the butter, stirring frequently, until brown bits begin to form on the bottom of the pan, about 5-6 minutes. Pay close attention as the butter can quickly go from brown to burnt in a matter of seconds. Once you see the brown bits forming and a nutty aroma fills the air, pull the butter from the heat immediately. Set aside.Cut the tops off of the sweet potatoes, lengthwise. Scoop the sweet potato flesh into a medium bowl, leaving the skins in tact. To the bowl, add the brown butter, 2 tablespoons of the fresh parsley, 3/4 of the chopped bacon, and 4 ounces of the goats cheese. Sprinkle with salt and black pepper to taste and mash the ingredients together until combined. Scoop the filling back into the sweet potatoes.Place the potatoes on a baking sheet that has been lined with foil or parchment paper. Place them back in the oven to bake for 25 minutes.While your potatoes are baking for a second time, prepare your avocado cream. In the bowl of your food processor or blender, combine the avocados, sour cream and buttermilk. Add a dash of salt and pepper and pulse until completely smooth and creamy.Once your potatoes have baked, remove from oven. Sprinkle on the remaining parsley, bacon and goats cheese. Drizzle with avocado cream and serve immediately.Enjoy!I hope you enjoy this recipe for brown butter twice baked sweet potatoes!",
    "time_to_cook": 95,
    "url": "http://www.pinkwhen.com/brown-butter-twice-baked-sweet-potatoes/"
  }
]